<template>
    <view style="background-color: #f2f2f2;padding-top: 100rpx;">
        <YSteps lineNum='0' color='#fff' backgroundColor='#000fff' :infoList='list'></YSteps>
    </view>
</template>
<script>
    import YSteps from '../../components/Y-Steps/Y-Steps.vue'
    export default {
        components: {
            YSteps
        },
        data() {
            return {
                list: [
                        {
                            date: '2020-1-4',
                            info: '的'
                        },

                        {
                            date: '2020-1-4',
                            info: '看见阿萨德和封口机撒的护肤科技撒地方即可撒地方就开始'
                        },

                        {
                            date: '2020-1-4',
                            info: '这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容'
                        },
                        {
                            date: '2020-1-4',
                            info: '这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容'
                        },
                        {
                            date: '2020-1-4',
                            info: '这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容'
                        },
                        {
                            date: '2020-1-4',
                            info: '这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容'
                        },
                        {
                            date: '2020-1-4',
                            info: '这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容'
                        },
                        {
                            date: '2020-1-4',
                            info: '这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容'
                        },

                    ]
                };

        },
        methods: {

        }
    }
</script>

<style>

</style>